package values

// Intent names
const (
	TwisterAnswerIntent = "TwisterAnswerIntent"
)

// Slot Names
const (
	AnswerSlot = "AnswerSlot"
)

// Map keys
const (
	SessionAttributeKeyMatch = "SessionAttributeKeyMatch"
)

var (
	// Twisters 早口言葉の出題
	Twisters = []string{
		"あめんぼあかいなあいうえお",
		"うきもにこえびもおよいでる",
		"かきのきくりのきかきくけこ",
		"きつつきこつこつかれけやき",
		"ささげにすをかけさしすせそ",
		"そのうおあさせでさしました",
		"たちましょらっぱでたちつてと",
		"とてとてたったととびたった",
		"なめくじのろのろなにぬねの",
		"なんどにぬめってなにねばる",
		"はとぽっぽほろほろはひふへほ",
		"ひなたのおへやにゃふえをふく",
		"まいまいねじまきまみむめも",
		"うめのみおちてもみもしまい",
		"やきぐりゆでぐりやいゆえよ",
		"やまだにひのつくよいのいえ",
		"らいちょうさむかろらりるれろ",
		"れんげがさいたらるりのとり",
		"わいわいわっしょいわいうえを",
		"うえきやいどがえおまつりだ",
		"じゃずしゃんそんかしゅ",
		"なまむぎなまごめなまたまご",
		"あかぱじゃまきぱじゃまちゃぱじゃま",
		"あおまきがみあかまきがみきまきがみ",
		"じょせつしゃじょせつさぎょうちゅう",
		"となりのきゃくはよくかきくうきゃくだ",
		"このくぎはひきぬきにくいくぎだ",
		"かきゃくせんのりょきゃく",
		"まじゅつしまじゅつしゅぎょうちゅう",
		"じみなじいやのじまんのじざけ",
		"だいいちちょしゃだいにちょしゃだいさんちょしゃ",
		"うちのつりびんはつぶれぬつりびんとなりのつりびんはつぶれるつりびん",
		"むさしのむさしがはらのむさしぼうべんけい",
		"にわにはにわとりがにわいました",
		"とうきょとっきょきょかきょくきょかきょくちょう",
		"おあやややおやにおあやまりおあややおやにおあやまり",
		"かえるぴょこぴょこみぴょこぴょこあわせてぴょこぴょこむぴょこぴょこ",
		"このすしはすこしすがききすぎた",
		"このくいのくぎはひきぬきにくい",
		"だしゃそうしゃいっそうでしょうしゃ",
		"このたけがきにたけたてかけたのはたけたてかけたかったからたけたてかけた",
		"ぼうずがびょうぶにじょうずにぼうずのえをかいた",
	}
)
